Revit 2026 API

# PDFExportOptionsZoomPercentage Property

---

Percentage of the zoom for the view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int ZoomPercentage { get; set; }
```
```vb
Public Property ZoomPercentage As Integer
	Get
	Set
```
```cpp
public:
property int ZoomPercentage {
	int get ();
	void set (int value);
}
```
```fsharp
member ZoomPercentage : int with get, set
```

#### Property Value

Int32

This property would be ignored if the ZoomType is FitToPage.

#### Reference

PDFExportOptions Class

Autodesk.Revit.DB Namespace